__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 320, 320, 3)  0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 320, 320, 16) 432         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 320, 320, 16) 64          conv2d_1[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 320, 320, 16) 0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 160, 160, 16) 0           leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 160, 160, 32) 4608        max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 160, 160, 32) 128         conv2d_2[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 160, 160, 32) 0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 80, 80, 32)   0           leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 80, 80, 64)   18432       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 80, 80, 64)   256         conv2d_3[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 80, 80, 64)   0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 40, 40, 64)   0           leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 40, 40, 128)  73728       max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 40, 40, 128)  512         conv2d_4[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 40, 40, 128)  0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 20, 20, 128)  0           leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 20, 20, 256)  294912      max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 20, 20, 256)  1024        conv2d_5[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 20, 20, 256)  0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 10, 10, 256)  0           leaky_re_lu_5[0][0]              
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 10, 10, 512)  1179648     max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 10, 10, 512)  2048        conv2d_6[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 10, 10, 512)  0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 10, 10, 512)  0           leaky_re_lu_6[0][0]              
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 10, 10, 1024) 4718592     max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 10, 10, 1024) 4096        conv2d_7[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (None, 10, 10, 1024) 0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 10, 10, 256)  262144      leaky_re_lu_7[0][0]              
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 10, 10, 256)  589824      leaky_re_lu_5[0][0]              
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 10, 10, 256)  1024        conv2d_8[0][0]                   
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 10, 10, 256)  1024        conv2d_14[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, 10, 10, 256)  0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
leaky_re_lu_12 (LeakyReLU)      (None, 10, 10, 256)  0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 10, 10, 128)  32768       leaky_re_lu_8[0][0]              
__________________________________________________________________________________________________
add_1 (Add)                     (None, 10, 10, 256)  0           leaky_re_lu_8[0][0]              
                                                                 leaky_re_lu_12[0][0]             
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 10, 10, 128)  512         conv2d_11[0][0]                  
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 10, 10, 256)  65536       add_1[0][0]                      
__________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)      (None, 10, 10, 128)  0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 10, 10, 256)  1024        conv2d_15[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 20, 20, 128)  0           leaky_re_lu_10[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)      (None, 10, 10, 256)  0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 20, 20, 384)  0           up_sampling2d_1[0][0]            
                                                                 leaky_re_lu_5[0][0]              
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 25600)        0           leaky_re_lu_13[0][0]             
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 10, 10, 512)  1179648     leaky_re_lu_8[0][0]              
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 20, 20, 256)  884736      concatenate_1[0][0]              
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 25600)        0           flatten_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 10, 10, 512)  2048        conv2d_9[0][0]                   
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 20, 20, 256)  1024        conv2d_12[0][0]                  
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 25600)        0           activation_1[0][0]               
__________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)       (None, 10, 10, 512)  0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)      (None, 20, 20, 256)  0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 1)            25601       dropout_1[0][0]                  
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 10, 10, 21)   10773       leaky_re_lu_9[0][0]              
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 20, 20, 21)   5397        leaky_re_lu_11[0][0]             
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1)            25601       dropout_1[0][0]                  
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 1)            0           dense_2[0][0]                    
==================================================================================================
Total params: 9,387,164
Trainable params: 9,379,772
Non-trainable params: 7,392
__________________________________________________________________________________________________
None
